Revit 2026 API

# DirectShapeIsSupportedDocument Method

---

Tests whether a DirectShape or a DirectShapeType may be created in this document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsSupportedDocument(
	Document document
)
```
```vb
Public Shared Function IsSupportedDocument (
	document As Document
) As Boolean
```
```cpp
public:
static bool IsSupportedDocument(
	Document^ document
)
```
```fsharp
static member IsSupportedDocument :
        document : Document -> bool
```

#### Parameters

document Document
     Document to be tested.

#### Return Value

Boolean True if a DirectShape or a DirectShapeType object can be created in this document, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Some types of Document, such as 2D families, can't support DirectShape functionality.

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace